#ifndef   __BSP_KEY_H
#define   __BSP_KEY_H

/*
*********************************************************************************************************
*                                              INCLUDE FILES
*********************************************************************************************************
*/

#include "stm32f4xx.h"


/*
*********************************************************************************************************
*                                               DEFINES
*********************************************************************************************************
*/


// 使用PF9作为长按键，以进入设置模式
#define      KEY1_PIN             	      GPIO_Pin_9

#define      KEY1_GPIO_PORT               GPIOF
#define      KEY1_GPIO_CLK                RCC_AHB1Periph_GPIOF                // 端口时钟                  

#define      KEY1_PIN_RD()	             (KEY1_GPIO_PORT->IDR & KEY1_PIN) 	  //读取IO脚状态返回0或非0		



typedef enum {
	KEY_UP = 0x00,             // 按键最初未被按下状态  
	KEY_HOLD = 0x01,           // 按键被按下保持状态
	KEY_DOWN = 0x02            // 表示长按键确认被按下
	
}Key_Status;
      





/*
*********************************************************************************************************
*                                           FUNCTION PROTOTYPES
*********************************************************************************************************
*/

void         BSP_KEY_Init                (void);

Key_Status   BSP_KEY_In_Long             (void);


#endif    //__BSP_LED_H





