
/*
*********************************************************************************************************
*                         该文件创建一个任务专门负责app对单片机wifi，电话号码信息
*                        的设置，即将wifi模块设置为服务端解析app传过来的指令
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                             INCLUDE FILES
*********************************************************************************************************
*/

#include "my_app_cfg.h"

/*
*********************************************************************************************************
*                                                 TCB
*********************************************************************************************************
*/

static  OS_TCB   LocalSettingTaskTCB;

/*
*********************************************************************************************************
*                                                STACKS
*********************************************************************************************************
*/

static  CPU_STK  LocalSettingTaskStk[LOCAL_SETTING_TASK_STK_SIZE];


/*
*********************************************************************************************************
*                                         FUNCTION PROTOTYPES
*********************************************************************************************************
*/

static  void     LocalSettingTask (void *p_arg);




/*
*********************************************************************************************************
*********************************************************************************************************
**                                         GLOBAL FUNCTIONS
*********************************************************************************************************
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                        LocalSettingTaskCreate()
*
* Description : 创建本地设置任务
*
* Argument(s) : none
*
* Return(s)   : DEF_FAIL 表示创建任务失败
*             : DEF_OK   表示创建任务成功
*
* Caller(s)   : Application
*
* Note(s)     : none.
*********************************************************************************************************
*/

CPU_BOOLEAN  LocalSettingTaskCreate (void)
{
	OS_ERR      err;
	
	// 创建管理flash的线程
	
	OSTaskCreate((OS_TCB    *)&LocalSettingTaskTCB,              /* Create the Sensor task                                 */
				(CPU_CHAR   *)"Local setting Task",
				(OS_TASK_PTR ) LocalSettingTask,
				(void       *) 0,
				(OS_PRIO     ) LOCAL_SETTING_TASK_PRIO,
				(CPU_STK    *)&LocalSettingTaskStk[0],
				(CPU_STK_SIZE) LOCAL_SETTING_TASK_STK_SIZE / 10,
				(CPU_STK_SIZE) LOCAL_SETTING_TASK_STK_SIZE,
				(OS_MSG_QTY  ) 0,                                // 无内建消息队列
				(OS_TICK     ) 0u,
				(void       *) 0,
				(OS_OPT      )(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR),
				(OS_ERR     *)&err);
			 
	if(err == OS_ERR_NONE) {
		return DEF_OK;
	}
	
	return DEF_FAIL;
	
}


/*
*********************************************************************************************************
*********************************************************************************************************
**                                         LOCAL FUNCTIONS
*********************************************************************************************************
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                        LocalSettingTask()
*
* Description : 该任务专门负责解析APP端发送的数据以完成对单片机的设置
*
* Argument(s) : p_arg is the argument passed to 'AppTaskStart()' by 'OSTaskCreate()'.
*
* Return(s)   : NONE
*
* Caller(s)   : none
*
* Note(s)     : none.
*********************************************************************************************************
*/

static uint8_t buf[180];

static  void  LocalSettingTask (void *p_arg)
{
	int i;
	OS_ERR            err;
	FLASH_DRIVER_MSG  *request = (FLASH_DRIVER_MSG *)buf;
	
	(void)p_arg;
	
	request ->option   = FLASH_OPTION_R;                       // 读操作
	request ->task_tcb = &LocalSettingTaskTCB;                 // 任务自身TCB
	request ->addr     = 0x00;
	request ->len      = 160;
	
	while (DEF_ON) {
		
		BSP_FLASH_Drivet_Request(request);
		
		for (i = 0; i < 160; i++) {
			BSP_UART_Printf(BSP_UART_ID_1, "%d\t", buf[sizeof(FLASH_DRIVER_MSG)+i]);
		}
		
	
		OSTimeDlyHMSM( 0, 0, 6, 0,
		               OS_OPT_TIME_HMSM_STRICT,
                       &err );
	}
	
}




